import memoji from "../assets/Memoji-11.png";
import newsPhoto from "../assets/news.jpg";

const posts = [
  {
    id: 1,
    title: "Сэндли ББСБ ХК Ногдол ашиг тараахаар боллоо",
    href: "#",
    description:
      "Сэндли ББСБ ХК Ногдол ашиг тараахаар боллоо. Сэндли ББСБ ХК нь 2023 оны цэвэр ашгаас 20.6755 хувийг буюу 1,251,991,232.27 төгрөгийн ногдол ашгийг хувьцаа эзэмшигчиддээ 2024 оны 5 дугаар сарын 21-ний өдөр мөнгөн хэлбэрээр хуваарилахаар шийдвэрлэсэнээ өнөөдөр зарлалаа. Ингэснээр нэгж хувьцаанд ногдох ногдол ашгийн хэмжээ 5.60 төгрөг байх юм. “Сэндли ББСБ” ХК нь 2022 оны есдүгээр сард компанийнхаа 29.97 хувийг олон нийтэд санал болгосноор нээлттэй хувьцаат компани болсон бөгөөд 2022 оны цэвэр ашгаас нэгж хувьцаанд ногдох хэмжээг 2.75 төгрөгөөр тогтоож, нийт 614.8 сая төгрөгийг хувьцаа эзэмшигчиддээ олгож байсан бол энэ жил хувьцаа эзэмшигчиддээ олгож буй ногдол ашгийн хэмжээ өссөн байна.",
    date: "2024-02-19",
    author: {
      name: "Michael Foster",
      role: "Co-Founder / CTO",
      href: "#",
    },
  },
  {
    id: 2,
    title: "Сэндли ББСБ ХК Ногдол ашиг тараахаар боллоо",
    href: "#",
    description:
      "Сэндли ББСБ ХК Ногдол ашиг тараахаар боллоо. Сэндли ББСБ ХК нь 2023 оны цэвэр ашгаас 20.6755 хувийг буюу 1,251,991,232.27 төгрөгийн ногдол ашгийг хувьцаа эзэмшигчиддээ 2024 оны 5 дугаар сарын 21-ний өдөр мөнгөн хэлбэрээр хуваарилахаар шийдвэрлэсэнээ өнөөдөр зарлалаа. Ингэснээр нэгж хувьцаанд ногдох ногдол ашгийн хэмжээ 5.60 төгрөг байх юм. “Сэндли ББСБ” ХК нь 2022 оны есдүгээр сард компанийнхаа 29.97 хувийг олон нийтэд санал болгосноор нээлттэй хувьцаат компани болсон бөгөөд 2022 оны цэвэр ашгаас нэгж хувьцаанд ногдох хэмжээг 2.75 төгрөгөөр тогтоож, нийт 614.8 сая төгрөгийг хувьцаа эзэмшигчиддээ олгож байсан бол энэ жил хувьцаа эзэмшигчиддээ олгож буй ногдол ашгийн хэмжээ өссөн байна.",
    date: "2024-02-19",

    author: {
      name: "Michael Foster",
      role: "Co-Founder / CTO",
      href: "#",
    },
  },
  {
    id: 3,
    title: "Сэндли ББСБ ХК Ногдол ашиг тараахаар боллоо",
    href: "#",
    description:
      "Сэндли ББСБ ХК Ногдол ашиг тараахаар боллоо. Сэндли ББСБ ХК нь 2023 оны цэвэр ашгаас 20.6755 хувийг буюу 1,251,991,232.27 төгрөгийн ногдол ашгийг хувьцаа эзэмшигчиддээ 2024 оны 5 дугаар сарын 21-ний өдөр мөнгөн хэлбэрээр хуваарилахаар шийдвэрлэсэнээ өнөөдөр зарлалаа. Ингэснээр нэгж хувьцаанд ногдох ногдол ашгийн хэмжээ 5.60 төгрөг байх юм. “Сэндли ББСБ” ХК нь 2022 оны есдүгээр сард компанийнхаа 29.97 хувийг олон нийтэд санал болгосноор нээлттэй хувьцаат компани болсон бөгөөд 2022 оны цэвэр ашгаас нэгж хувьцаанд ногдох хэмжээг 2.75 төгрөгөөр тогтоож, нийт 614.8 сая төгрөгийг хувьцаа эзэмшигчиддээ олгож байсан бол энэ жил хувьцаа эзэмшигчиддээ олгож буй ногдол ашгийн хэмжээ өссөн байна.",
    date: "2024-02-19",

    author: {
      name: "Michael Foster",
      role: "Co-Founder / CTO",
      href: "#",
    },
  },
  {
    id: 1,
    title: "Сэндли ББСБ ХК Ногдол ашиг тараахаар боллоо",
    href: "#",
    description:
      "Сэндли ББСБ ХК Ногдол ашиг тараахаар боллоо. Сэндли ББСБ ХК нь 2023 оны цэвэр ашгаас 20.6755 хувийг буюу 1,251,991,232.27 төгрөгийн ногдол ашгийг хувьцаа эзэмшигчиддээ 2024 оны 5 дугаар сарын 21-ний өдөр мөнгөн хэлбэрээр хуваарилахаар шийдвэрлэсэнээ өнөөдөр зарлалаа. Ингэснээр нэгж хувьцаанд ногдох ногдол ашгийн хэмжээ 5.60 төгрөг байх юм. “Сэндли ББСБ” ХК нь 2022 оны есдүгээр сард компанийнхаа 29.97 хувийг олон нийтэд санал болгосноор нээлттэй хувьцаат компани болсон бөгөөд 2022 оны цэвэр ашгаас нэгж хувьцаанд ногдох хэмжээг 2.75 төгрөгөөр тогтоож, нийт 614.8 сая төгрөгийг хувьцаа эзэмшигчиддээ олгож байсан бол энэ жил хувьцаа эзэмшигчиддээ олгож буй ногдол ашгийн хэмжээ өссөн байна.",
    date: "2024-02-19",

    author: {
      name: "Michael Foster",
      role: "Co-Founder / CTO",
      href: "#",
    },
  },
  {
    id: 2,
    title: "Сэндли ББСБ ХК Ногдол ашиг тараахаар боллоо",
    href: "#",
    description:
      "Сэндли ББСБ ХК Ногдол ашиг тараахаар боллоо. Сэндли ББСБ ХК нь 2023 оны цэвэр ашгаас 20.6755 хувийг буюу 1,251,991,232.27 төгрөгийн ногдол ашгийг хувьцаа эзэмшигчиддээ 2024 оны 5 дугаар сарын 21-ний өдөр мөнгөн хэлбэрээр хуваарилахаар шийдвэрлэсэнээ өнөөдөр зарлалаа. Ингэснээр нэгж хувьцаанд ногдох ногдол ашгийн хэмжээ 5.60 төгрөг байх юм. “Сэндли ББСБ” ХК нь 2022 оны есдүгээр сард компанийнхаа 29.97 хувийг олон нийтэд санал болгосноор нээлттэй хувьцаат компани болсон бөгөөд 2022 оны цэвэр ашгаас нэгж хувьцаанд ногдох хэмжээг 2.75 төгрөгөөр тогтоож, нийт 614.8 сая төгрөгийг хувьцаа эзэмшигчиддээ олгож байсан бол энэ жил хувьцаа эзэмшигчиддээ олгож буй ногдол ашгийн хэмжээ өссөн байна.",
    date: "2024-02-19",
    author: {
      name: "Michael Foster",
      role: "Co-Founder / CTO",
      href: "#",
    },
  },
  {
    id: 3,
    title: "Сэндли ББСБ ХК Ногдол ашиг тараахаар боллоо",
    href: "#",
    description:
      "Сэндли ББСБ ХК Ногдол ашиг тараахаар боллоо. Сэндли ББСБ ХК нь 2023 оны цэвэр ашгаас 20.6755 хувийг буюу 1,251,991,232.27 төгрөгийн ногдол ашгийг хувьцаа эзэмшигчиддээ 2024 оны 5 дугаар сарын 21-ний өдөр мөнгөн хэлбэрээр хуваарилахаар шийдвэрлэсэнээ өнөөдөр зарлалаа. Ингэснээр нэгж хувьцаанд ногдох ногдол ашгийн хэмжээ 5.60 төгрөг байх юм. “Сэндли ББСБ” ХК нь 2022 оны есдүгээр сард компанийнхаа 29.97 хувийг олон нийтэд санал болгосноор нээлттэй хувьцаат компани болсон бөгөөд 2022 оны цэвэр ашгаас нэгж хувьцаанд ногдох хэмжээг 2.75 төгрөгөөр тогтоож, нийт 614.8 сая төгрөгийг хувьцаа эзэмшигчиддээ олгож байсан бол энэ жил хувьцаа эзэмшигчиддээ олгож буй ногдол ашгийн хэмжээ өссөн байна.",
    date: "2024-02-19",
    author: {
      name: "Michael Foster",
      role: "Co-Founder / CTO",
      href: "#",
    },
  },
];

export default function News() {
  return (
    <div className="bg-white sm:pb-2">
      <div>
        <div className="mx-auto grid max-w-2xl grid-cols-1 gap-x-8 gap-y-16 pt-10 sm:mt-5 sm:pt-5 lg:mx-0 lg:max-w-none lg:grid-cols-3">
          {posts.map((post) => (
            <article
              key={post.id}
              className="bg-blue-50 flex max-w-xl flex-col items-start justify-between p-5 rounded-xl shadow-md"
            >
              <div className="flex justify-center w-full">
                <img
                  src={newsPhoto}
                  alt="news-photo"
                  className=" m-2 rounded-lg"
                />
              </div>

              <div className="group relative">
                <h3 className="mt-3 text-lg font-semibold leading-6 text-gray-900 group-hover:text-blue-600">
                  <a href={post.href}>
                    <span className="absolute inset-0" />
                    {post.title}
                  </a>
                </h3>
                <p className="mt-5 line-clamp-3 text-sm leading-6 text-gray-600">
                  {post.description}
                </p>
              </div>

              <div className="relative mt-8 flex items-center gap-x-4 w-full justify-between">
                <div className="flex">
                  <img
                    src={memoji}
                    alt=""
                    className="h-10 w-10 rounded-full bg-gray-50"
                  />
                  <div className="text-sm leading-6">
                    <p className="font-semibold text-gray-900">
                      <a href={post.author.href}>
                        <span className="absolute inset-0" />
                        {post.author.name}
                      </a>
                    </p>
                    <p className="text-gray-600">{post.author.role}</p>
                  </div>
                </div>

                <div className="flex  gap-x-4 text-xs">
                  <time dateTime={post.datetime} className="text-gray-500">
                    {post.date}
                  </time>
                </div>
              </div>
            </article>
          ))}
        </div>
      </div>
    </div>
  );
}
