[
  {
    "id": 1,
    "title": "Sendly БНСУ-д нэвтрэхээр ажиллаж байна",
    "description": "“Sendly” ББСБ нь 2015 оноос хойш Санхүүгийн зохицуулах хорооны Мөнгөн гуйвуулга, цахим төлбөр тооцоо, гадаад валют арилжааны үйл ажиллагаа, зээлийн үйл ажиллагаа эрхлэх тусгай зөвшөөрөлтэйгээр үйл ажиллагаа явуулж байна. Sendly мөнгөн гуйвуулгын үйлчилгээ нь анх 2020 оны тавдугаар сард АНУ-аас Монгол руу мөнгөн гуйвуулгын үйлчилгээг зах зээлд нэвтрүүлснээр бизнесийн гараагаа эхлүүлж байсан бол үйлчилгээгээ өргөжүүлэн 2021 оны тавдугаар сард Австралиас Монгол руу, арваннэгдүгээр сард Японоос Монгол чиглэлд мөнгөн гуйвуулгын үйлчилгээ нэвтрүүлсэн. Харин энэ удаад БНСУ-д ажиллаж амьдарч буй Монголчууддаа санхүүгийн бүтээгдэхүүн үйлчилгээг хамгийн хурдан шуурхай, хамгийн бага зардлаар хэрэглэх боломжийг нээж өгөөд байна. Дэлхийн 87 улсад 180 мянга гаруй Монголчууд ажиллаж, амьдарч байна гэсэн албан бус тоо баримт бий. Эдгээр иргэдийн 25 хувь орчим нь БНСУ-д оршин суудаг. Үүнийг дагаад тус улсад ажиллаж, амьдарч байгаа иргэд гэр бүл, хайртай дотны хүмүүстээ мөнгө шилжүүлэх, төлбөр тооцоо хийх зэрэг өөрсдийн хэрэгцээт санхүүгийн үйлчилгээнд хамрагдах хэрэгцээ шаардлага зайлшгүй гарч байдаг. Уг асуудлыг шийдвэрлэхэд өөрсдийн хувь нэмрээ оруулахаар Sendly Mongolia ХХК-ийн хамт олон зорин ажиллаж байна. Sendly аппликейшны хэрэглэгчид БНСУ-ын хаанаас ч, богино хугацаанд, хамгийн бага шимтгэлтэйгээр өөрийн нэр дээрх данснаасаа Монголын дурын арилжааны банкны данс руу аюулгүйгээр мөнгөө шилжүүлэх боломжтой. Мөн Монгол дахь онлайн дэлгүүрүүдээс шууд худалдан авалт хийх, Орон сууцны зээлд хамрагдах, Сайн дурын нийгмийн даатгалд хамрагдах зэрэг санхүүгийн нэмэлт үйлчилгээг авах боломжтой юм.",
    "date": "2024-02-19",
    "author": {
      "name": "Admin",
      "role": "CTO"
    },
    "photo": "/src/assets/team-1.svg"
  },
  {
    "id": 2,
    "title": "Сэндли ББСБ ХК Ногдол ашиг тараахаар боллоо",
    "description": "2 Сэндли ББСБ ХК Ногдол ашиг тараахаар боллоо. Сэндли ББСБ ХК нь 2023 оны цэвэр ашгаас 20.6755 хувийг буюу 1,251,991,232.27 төгрөгийн ногдол ашгийг хувьцаа эзэмшигчиддээ 2024 оны 5 дугаар сарын 21-ний өдөр мөнгөн хэлбэрээр хуваарилахаар шийдвэрлэсэнээ өнөөдөр зарлалаа. Ингэснээр нэгж хувьцаанд ногдох ногдол ашгийн хэмжээ 5.60 төгрөг байх юм. “Сэндли ББСБ” ХК нь 2022 оны есдүгээр сард компанийнхаа 29.97 хувийг олон нийтэд санал болгосноор нээлттэй хувьцаат компани болсон бөгөөд 2022 оны цэвэр ашгаас нэгж хувьцаанд ногдох хэмжээг 2.75 төгрөгөөр тогтоож, нийт 614.8 сая төгрөгийг хувьцаа эзэмшигчиддээ олгож байсан бол энэ жил хувьцаа эзэмшигчиддээ олгож буй ногдол ашгийн хэмжээ өссөн байна.",
    "date": "2024-02-19",
    "author": {
      "name": "Michael Foster",
      "role": "Co-Founder / CTO"
    },
    "photo": "/src/assets/sendly-banner.png"
  },
  {
    "id": 3,
    "title": "МАБМТ-ны ISO/IEC 27001:2013 магадлах аудитад амжилттай хамрагдлаа",
    "description": "Сэндли ББСБ ХК нь байгууллагын болоод хэрэглэгчийн мэдээллийн бүрэн бүтэн, нууцлалтай байдлыг хадгалах, хамгаалах болон системийн хэвийн, найдвартай ажиллагааг бүрэн хангах, хүртээмжтэй байдлыг хангахын тулд 2022 оноос хойш Олон улсын Мэдээллийн аюулгүй байдал менежментийн тогтолцооны ISO/IEC 27001:2013 стандартыг үйл ажиллагаандаа нэвтрүүлэн хэрэгжүүлж байгаа билээ.",
    "date": "2024-02-19",
    "author": {
      "name": "Michael Foster",
      "role": "Co-Founder / CTO"
    },
    "photo": "/src/assets/news.png"
  }
]
